# **Mount Drive**

The code cell below is reponsible for mounting google drive, making it easy to access dataset from the drive folder directly.

In [ ]:
import pandas as pd
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

# **Uploading data sets from drive**

In [ ]:
path = '/content/drive/My Drive/Project - CIS 550'

In [ ]:
# Kaggle data set
recipes_df = pd.read_csv("/content/drive/My Drive/Project - CIS 550/PP_recipes.csv")
users_df = pd.read_csv("/content/drive/My Drive/Project - CIS 550/PP_users.csv")
interactions_csv = pd.read_csv("/content/drive/My Drive/Project - CIS 550/RAW_interactions.csv")
raw_recipes = pd.read_csv("/content/drive/My Drive/Project - CIS 550/RAW_recipes.csv")

In [ ]:
recipes_df.head(4)

       id  ...                                     ingredient_ids
0  424415  ...                      [389, 7655, 6270, 1527, 3406]
1  146223  ...  [2683, 4969, 800, 5298, 840, 2499, 6632, 7022,...
2  312329  ...  [1257, 7655, 6270, 590, 5024, 1119, 4883, 6696...
3   74301  ...   [7940, 3609, 7060, 6265, 1170, 6654, 5003, 3561]

[4 rows x 8 columns]

In [ ]:
recipes_df.describe()

                  id              i  calorie_level
count  178265.000000  178265.000000  178265.000000
mean   213461.803007   89132.000000       0.863192
std    138266.712754   51460.817206       0.791486
min        38.000000       0.000000       0.000000
25%     94576.000000   44566.000000       0.000000
50%    196312.000000   89132.000000       1.000000
75%    320562.000000  133698.000000       2.000000
max    537716.000000  178264.000000       2.000000

In [ ]:
users_df.describe()

                  u       n_items     n_ratings
count  25076.000000  25076.000000  25076.000000
mean   12537.500000     27.871311     27.871311
std     7238.962011    122.729039    122.729039
min        0.000000      2.000000      2.000000
25%     6268.750000      3.000000      3.000000
50%    12537.500000      6.000000      6.000000
75%    18806.250000     16.000000     16.000000
max    25075.000000   6437.000000   6437.000000

In [ ]:
users_df.head(5)

   u  ... n_ratings
0  0  ...        31
1  1  ...        39
2  2  ...        27
3  3  ...      1513
4  4  ...       376

[5 rows x 6 columns]

In [ ]:
interactions_csv.describe()

            user_id     recipe_id        rating
count  1.132367e+06  1.132367e+06  1.132367e+06
mean   1.384291e+08  1.608972e+05  4.411016e+00
std    5.014269e+08  1.303987e+05  1.264752e+00
min    1.533000e+03  3.800000e+01  0.000000e+00
25%    1.354700e+05  5.425700e+04  4.000000e+00
50%    3.309370e+05  1.205470e+05  5.000000e+00
75%    8.045500e+05  2.438520e+05  5.000000e+00
max    2.002373e+09  5.377160e+05  5.000000e+00

In [ ]:
interactions_csv.head(10)

      user_id  ...                                             review
0       38094  ...  Great with a salad. Cooked on top of stove for...
1     1293707  ...  So simple, so delicious! Great for chilly fall...
2        8937  ...  This worked very well and is EASY.  I used not...
3      126440  ...  I made the Mexican topping and took it to bunk...
4       57222  ...  Made the cheddar bacon topping, adding a sprin...
5       52282  ...  very very sweet. after i waited the 2 days i b...
6      124416  ...  Just an observation, so I will not rate.  I fo...
7  2000192946  ...  This recipe was OVERLY too sweet.  I would sta...
8       76535  ...                                         Very good!
9      273745  ...                             Better than the real!!

[10 rows x 5 columns]

In [ ]:
raw_recipes.head(2)

                                         name  ...  n_ingredients
0  arriba   baked winter squash mexican style  ...              7
1            a bit different  breakfast pizza  ...              6

[2 rows x 12 columns]

# **Imports**

Packages required for data cleaning are imported in the following code cells below.

In [ ]:
%%capture
!apt install libkrb5-dev
!wget https://downloads.apache.org/spark/spark-3.0.1/spark-3.0.1-bin-hadoop3.2.tgz
!tar xf spark-3.0.1-bin-hadoop3.2.tgz
!pip install findspark
!pip install sparkmagic
!pip install pyspark
! pip install pyspark --user
! pip install seaborn --user
! pip install plotly --user
! pip install imageio --user
! pip install folium --user

In [ ]:
%%capture
!apt update
!apt install gcc python-dev libkrb5-dev

In [ ]:
from pyspark.sql import SparkSession
from pyspark.sql.types import *
import pyspark.sql.functions as F


import os
spark = SparkSession.builder.appName('Graphs-HW2')\
.config("spark.driver.maxResultSize", "2g")\
.config("spark.driver.memory", "15g")\
.config('spark.executor.memory','32g')\
.getOrCreate()

In [ ]:
%load_ext sparkmagic.magics

In [ ]:
import numpy as np
import pandas as pd
import matplotlib

#misc
import gc
import time
import warnings


#graph section
import networkx as nx
#import heapq  # for getting top n number of things from list,dict
import pandas as pd
import numpy as np

# JSON parsing
import json

# HTML parsing
from lxml import etree
import urllib

# SQLite RDBMS
import sqlite3

# Time conversions
import time

# Parallel processing
# import swifter

# NoSQL DB
from pymongo import MongoClient
from pymongo.errors import DuplicateKeyError, OperationFailure

import os
os.environ["SPARK_HOME"] = "/content/spark-3.0.1-bin-hadoop3.2"
os.environ["JAVA_HOME"] = "/usr/lib/jvm/java-8-openjdk-amd64"
import pyspark
from pyspark.sql import SQLContext

In [ ]:

try:
    if(spark == None):
        spark = SparkSession.builder.appName('Initial').getOrCreate()
        sqlContext=SQLContext(spark)
except NameError:
    spark = SparkSession.builder.appName('Initial').getOrCreate()
    sqlContext=SQLContext(spark)

# **Importing Yelp data set**

In [ ]:
# Yelp Data Set
!wget https://penn-cis545-files.s3.amazonaws.com/yelp_business_attributes.csv -P /content
!wget https://penn-cis545-files.s3.amazonaws.com/yelp_business.csv -P /content
!wget https://penn-cis545-files.s3.amazonaws.com/yelp_checkin.csv -P /content
!wget https://penn-cis545-files.s3.amazonaws.com/yelp_review2.csv -P /content
!wget https://penn-cis545-files.s3.amazonaws.com/yelp_user.csv -P /content

--2020-11-16 18:29:05--  https://penn-cis545-files.s3.amazonaws.com/yelp_business_attributes.csv
Resolving penn-cis545-files.s3.amazonaws.com (penn-cis545-files.s3.amazonaws.com)... 52.216.105.195
Connecting to penn-cis545-files.s3.amazonaws.com (penn-cis545-files.s3.amazonaws.com)|52.216.105.195|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 41377121 (39M) [text/csv]
Saving to: ‘/content/yelp_business_attributes.csv’

yelp_business_attri 100%[===================>]  39.46M  30.3MB/s    in 1.3s

2020-11-16 18:29:07 (30.3 MB/s) - ‘/content/yelp_business_attributes.csv’ saved [41377121/41377121]

--2020-11-16 18:29:07--  https://penn-cis545-files.s3.amazonaws.com/yelp_business.csv
Resolving penn-cis545-files.s3.amazonaws.com (penn-cis545-files.s3.amazonaws.com)... 52.217.18.4
Connecting to penn-cis545-files.s3.amazonaws.com (penn-cis545-files.s3.amazonaws.com)|52.217.18.4|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 31760674 (30M) [text/csv]
Saving to: ‘/content/yelp_business.csv’

yelp_business.csv   100%[===================>]  30.29M  27.3MB/s    in 1.1s

2020-11-16 18:29:08 (27.3 MB/s) - ‘/content/yelp_business.csv’ saved [31760674/31760674]

--2020-11-16 18:29:08--  https://penn-cis545-files.s3.amazonaws.com/yelp_checkin.csv
Resolving penn-cis545-files.s3.amazonaws.com (penn-cis545-files.s3.amazonaws.com)... 52.217.90.28
Connecting to penn-cis545-files.s3.amazonaws.com (penn-cis545-files.s3.amazonaws.com)|52.217.90.28|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 135964892 (130M) [text/csv]
Saving to: ‘/content/yelp_checkin.csv’

yelp_checkin.csv    100%[===================>] 129.67M  33.4MB/s    in 4.3s

2020-11-16 18:29:13 (30.4 MB/s) - ‘/content/yelp_checkin.csv’ saved [135964892/135964892]

--2020-11-16 18:29:13--  https://penn-cis545-files.s3.amazonaws.com/yelp_review2.csv
Resolving penn-cis545-files.s3.amazonaws.com (penn-cis545-files.s3.amazonaws.com)... 52.217.103.36
Connecting to penn-cis545-files.s3.amazonaws.com (penn-cis545-files.s3.amazonaws.com)|52.217.103.36|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 3791120545 (3.5G) [text/csv]
Saving to: ‘/content/yelp_review2.csv’

yelp_review2.csv    100%[===================>]   3.53G  42.5MB/s    in 86s

2020-11-16 18:30:40 (41.9 MB/s) - ‘/content/yelp_review2.csv’ saved [3791120545/3791120545]

--2020-11-16 18:30:40--  https://penn-cis545-files.s3.amazonaws.com/yelp_user.csv
Resolving penn-cis545-files.s3.amazonaws.com (penn-cis545-files.s3.amazonaws.com)... 52.217.73.164
Connecting to penn-cis545-files.s3.amazonaws.com (penn-cis545-files.s3.amazonaws.com)|52.217.73.164|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 1363176944 (1.3G) [text/csv]
Saving to: ‘/content/yelp_user.csv’

yelp_user.csv       100%[===================>]   1.27G  45.6MB/s    in 30s

2020-11-16 18:31:10 (43.4 MB/s) - ‘/content/yelp_user.csv’ saved [1363176944/1363176944]

# **Reading data as spark data frames.**

In [ ]:
spark_reader = spark.read.option("quote", "\"").option("escape", "\"")

yelp_business_sdf = spark_reader.load('yelp_business.csv', format="csv",header=True)
yelp_business_attributes_sdf = spark.read.load('yelp_business_attributes.csv', format="csv",header=True) 
yelp_check_in_sdf = spark.read.load('yelp_checkin.csv', format="csv",header=True)
yelp_reviews_sdf = spark.read.load('yelp_review2.csv', format="csv",header=True)
yelp_users_sdf = spark.read.load('yelp_user.csv', format="csv",header=True)

In [ ]:
yelp_business_sdf.show()

+--------------------+--------------------+------------------+--------------------+--------------+-----+-----------+-------------+--------------+-----+------------+-------+--------------------+
|         business_id|                name|      neighborhood|             address|          city|state|postal_code|     latitude|     longitude|stars|review_count|is_open|          categories|
+--------------------+--------------------+------------------+--------------------+--------------+-----+-----------+-------------+--------------+-----+------------+-------+--------------------+
|FYWN1wneV18bWNgQj...|  "Dental by Design"|              null|"4855 E Warner Rd...|     Ahwatukee|   AZ|      85044|   33.3306902|  -111.9785992|  4.0|          22|      1|Dentists;General ...|
|He-G7vWjzVUysIKrf...|"Stephen Szabo Sa...|              null|"3101 Washington Rd"|      McMurray|   PA|      15317|   40.2916853|   -80.1048999|  3.0|          11|      1|Hair Stylists;Hai...|
|KQPW8lFf1y5BT2Mxi...|"Western Motor Ve...|              null|"6025 N 27th Ave,...|       Phoenix|   AZ|      85017|   33.5249025|  -112.1153098|  1.5|          18|      1|Departments of Mo...|
|8DShNS-LuFqpEWIp0...|  "Sports Authority"|              null|"5000 Arizona Mil...|         Tempe|   AZ|      85282|   33.3831468|  -111.9647254|  3.0|           9|      0|Sporting Goods;Sh...|
|PfOCPjBrlQAnz__NX...|"Brick House Tave...|              null|      "581 Howe Ave"|Cuyahoga Falls|   OH|      44221|   41.1195346|   -81.4756898|  3.5|         116|      1|American (New);Ni...|
|o9eMRCWt5PkpLDE0g...|           "Messina"|              null|    "Richterstr. 11"|     Stuttgart|   BW|      70567|      48.7272|       9.14795|  4.0|           5|      1| Italian;Restaurants|
|kCoE3jvEtg6UVz5SO...|        "BDJ Realty"|         Summerlin|"2620 Regatta Dr,...|     Las Vegas|   NV|      89128|     36.20743|    -115.26846|  4.0|           5|      1|Real Estate Servi...|
|OD2hnuuTJI9uotcKy...|       "Soccer Zone"|              null|"7240 W Lake Mead...|     Las Vegas|   NV|      89128|   36.1974844|  -115.2496601|  1.5|           9|      1|Shopping;Sporting...|
|EsMcGiZaQuG1OOvL9...|  "Any Given Sundae"|              null|"2612 Brandt Scho...|       Wexford|   PA|      15090|40.6151022445|-80.0913487465|  5.0|          15|      1|Coffee & Tea;Ice ...|
|TGWhGNusxyMaA4kQV...|"Detailing Gone M...|              null|                  ""|     Henderson|   NV|      89014|36.0558252127| -115.04635039|  5.0|           7|      1|Automotive;Auto D...|
|XOSRcvtaKc_Q5H1SA...| "East Coast Coffee"|              null|  "737 West Pike St"|       Houston|   PA|      15342|40.2415480142|-80.2128151059|  4.5|           3|      0|Breakfast & Brunc...|
|Y0eMNa5C-YU1RQOZf...|"CubeSmart Self S...|              null|"2414 South Gilbe...|      Chandler|   AZ|      85286|   33.2717201|  -111.7912569|  5.0|          23|      1|Local Services;Se...|
|xcgFnd-MwkZeO5G2H...|"T & T Bakery and...|   Markham Village|  "35 Main Street N"|       Markham|   ON|    L3P 1X3|   43.8751774|   -79.2601532|  4.0|          38|      1|Bakeries;Bagels;Food|
|NmZtoE3v8RdSJEczY...|"Complete Dental ...|              null|  "107 Whitaker Str"|     Homestead|   PA|      15120|   40.4014882|   -79.8879161|  2.0|           5|      1|General Dentistry...|
|fNMVV_ZX7CJSDWQGd...|"Showmars Governm...|            Uptown|      "600 E 4th St"|     Charlotte|   NC|      28202|   35.2216474|   -80.8393449|  3.5|           7|      1|Restaurants;Ameri...|
|l09JfMeQ6ynYs5MCJ...|    "Alize Catering"|Yonge and Eglinton|     "2459 Yonge St"|       Toronto|   ON|    M4P 2H6|   43.7113993|   -79.3993388|  3.0|          12|      0|Italian;French;Re...|
|IQSlT5jGE6CCDhSG0...|    "T & Y Nail Spa"|              null|"8411 W Thunderbi...|        Peoria|   AZ|      85381|   33.6086538|  -112.2400118|  3.0|          20|      1|Beauty & Spas;Nai...|
|b2I2DXtZVnpUMCXp1...|"Meineke Car Care...|              null|  "2518 Ironwood Dr"|   Sun Prairie|   WI|      53590|     43.18508|    -89.262047|  3.5|           9|      1|Tires;Oil Change ...|
|0FMKDOU8TJT1x87OK...|"Senior's Barber ...|              null|  "13375 W McDowell"|      Goodyear|   AZ|      85395|    33.463629|   -112.347038|  5.0|          65|      1|Barbers;Beauty & ...|
|Gu-xs3NIQTj3Mj2xY...|"Maxim Bakery & R...|              null|"9665 Bayview Ave...| Richmond Hill|   ON|    L4C 9V4|   43.8675648|   -79.4126618|  3.5|          34|      1|French;Food;Baker...|
+--------------------+--------------------+------------------+--------------------+--------------+-----+-----------+-------------+--------------+-----+------------+-------+--------------------+
only showing top 20 rows

The Yelp Business data sets contains information for businesses related to all kinds of categories. However, the category of interest to us are restaurants. 

We query only those rows from the data set that fall under the restaurant category.

In [ ]:
yelp_business_sdf.createOrReplaceTempView("yelp_b")
query = """SELECT * FROM yelp_b WHERE categories LIKE '%Restaurants%' and is_open=1"""
yelp_rest = spark.sql(query)
yelp_rest.createOrReplaceTempView("yelp_rest")

Converting spark data frames to pandas data frames.

In [ ]:
yelp_rest_df = yelp_rest.toPandas()
yelp_rest_df.describe()

                   business_id          name  ... is_open         categories
count                    40394         40394  ...   40394              40394
unique                   40394         27179  ...       1              20671
top     sRUesAB_yPZzzqMtjrwFsA  "McDonald's"  ...       1  Restaurants;Pizza
freq                         1           669  ...   40394                746

[4 rows x 13 columns]

In [ ]:
yelp_reviews_sdf.show()
yelp_reviews_sdf.count()

+--------------------+--------------------+--------------------+-----+----------+--------------------+------+-----+----+
|           review_id|             user_id|         business_id|stars|      date|                text|useful|funny|cool|
+--------------------+--------------------+--------------------+-----+----------+--------------------+------+-----+----+
|vkVSCC7xljjrAI4UG...|bv2nCi5Qv5vroFiqK...|AEx2SYEUJmTxVVB18...|    5|2016-05-28|Super simple plac...|     0|    0|   0|
|n6QzIUObkYshz4dz2...|bv2nCi5Qv5vroFiqK...|VR6GpWIda3SfvPC-l...|    5|2016-05-28|Small unassuming ...|     0|    0|   0|
|MV3CcKScW05u5LVfF...|bv2nCi5Qv5vroFiqK...|CKC0-MOWMqoeWf6s-...|    5|2016-05-28|Lester's is locat...|     0|    0|   0|
|IXvOzsEMYtiJI0CAR...|bv2nCi5Qv5vroFiqK...|ACFtxLv8pGrrxMm6E...|    4|2016-05-28|Love coming here....|     0|    0|   0|
|L_9BTb55X0GDtThi6...|bv2nCi5Qv5vroFiqK...|s2I_Ni76bjJNK9yG6...|    4|2016-05-28|Had their chocola...|     0|    0|   0|
|HRPm3vEZ_F-33TYVT...|_4iMDXbXZ1p1ONG29...|8QWPlVQ6D-OExqXoa...|    5|2014-09-24|Cycle Pub Las Veg...|     1|    0|   0|
|ymAUG8DZfQcFTBSOi...|u0LXt3Uea_GidxRW1...|9_CGhHMz8698M9-Pk...|    4|2012-05-11|Who would have gu...|     0|    0|   2|
|8UIishPUD92hXtScS...|u0LXt3Uea_GidxRW1...|gkCorLgPyQLsptTHa...|    4|2015-10-27|Always drove past...|     1|    0|   0|
|w41ZS9shepfO3uEyh...|u0LXt3Uea_GidxRW1...|5r6-G9C4YLbC7Ziz5...|    3|2013-02-09|Not bad!! Love th...|     1|    0|   0|
|WF_QTN3p-thD74hqp...|u0LXt3Uea_GidxRW1...|fDF_o2JPU8BR1Gya-...|    5|2016-04-06|Love this place! ...|     3|    0|   0|
|PIsUSmvaUWB00qv5K...|u0LXt3Uea_GidxRW1...|z8oIoCT1cXz7gZP5G...|    4|2013-05-01|This is currently...|     1|    0|   0|
|PdZ_uFjbbkjtm3SCY...|u0LXt3Uea_GidxRW1...|XWTPNfskXoUL-Lf32...|    3|2011-09-28|Server was a litt...|     5|    0|   1|
|x5oV6wm9_Pb1QQ6jk...|u0LXt3Uea_GidxRW1...|13nKUHH-uEUXVZylg...|    1|2011-02-16|I thought Tidy's ...|     9|    0|   1|
|lsoSqIrrDbQvWpMvs...|u0LXt3Uea_GidxRW1...|RtUvSWO_UZ8V3Wpj0...|    3|2012-12-03|Wanted to check o...|     2|    1|   1|
|23eqwlZzCWZkADWfd...|u0LXt3Uea_GidxRW1...|Aov96CM4FZAXeZvKt...|    5|2010-07-16|This place is awe...|     2|    0|   1|
|FunI9om-aK5oMIIJm...|u0LXt3Uea_GidxRW1...|0W4lkclzZThpx3V65...|    4|2011-09-28|a must stop when ...|     0|    0|   0|
|FKu4iU62EmWT6GZXP...|u0LXt3Uea_GidxRW1...|fdnNZMk1NP7ZhL-YM...|    1|2012-10-23|I too have been t...|     0|    0|   0|
|xdu8nXrbNKeaywCX7...|u0LXt3Uea_GidxRW1...|PFPUMF38-lraKzLcT...|    3|2010-09-15|Came here with my...|     2|    0|   0|
|K7o5jDInfmX3cY5oH...|u0LXt3Uea_GidxRW1...|oWTn2IzrprsRkPfUL...|    3|2012-09-23|Came here for a b...|     4|    0|   0|
|WYDFJOBOl7cycd7gN...|u0LXt3Uea_GidxRW1...|zgQHtqX0gqMw1nlBZ...|    1|2012-10-30|really excited to...|     9|    2|   1|
+--------------------+--------------------+--------------------+-----+----------+--------------------+------+-----+----+
only showing top 20 rows

5278853

# **Reviews**

Getting reviews for each restaurant by joining on business id from Yelp reviews and Restaurant data set.

In [ ]:
yelp_reviews_sdf.createOrReplaceTempView("reviews")
query = """
SELECT DISTINCT r.review_id as index, null as recipe_id, r.stars as rating, 
r.text as review, r.business_id as restaurant_id
FROM reviews r join yelp_rest b on r.business_id=b.business_id;
"""
rest_reviews = spark.sql(query)
rest_reviews.createOrReplaceTempView("rest_reviews")
rest_reviews.show()

In [ ]:
spark.catalog.clearCache()

In [ ]:
rest_reviews.toPandas().to_csv(path+'/RestReview.csv')
rest_reviews2 = spark.sql("SELECT * FROM rest_reviews ORDER BY index desc limit")

Extracting recipe reviews.

In [ ]:
import numpy as np
recipe_review = interactions_csv[['recipe_id','rating','review']].reset_index()
recipe_review['restaurant_id'] = np.nan
display(recipe_review)
recipe_review.to_csv(path+'/RecipeReview.csv')

           index  ...  restaurant_id
0              0  ...            NaN
1              1  ...            NaN
2              2  ...            NaN
3              3  ...            NaN
4              4  ...            NaN
...          ...  ...            ...
1132362  1132362  ...            NaN
1132363  1132363  ...            NaN
1132364  1132364  ...            NaN
1132365  1132365  ...            NaN
1132366  1132366  ...            NaN

[1132367 rows x 5 columns]

Combining restaurant reviews and recipe reviews as a single table.

In [ ]:
Reviews = pd.concat([recipe_review,rest_reviews])
Reviews

In [ ]:
yelp_business_attributes_sdf.show()
# yelp_business_attributes_sdf.count()

# **RecipeTags**


Splitting values in a list under the tags column on **'  ,  '** and extracting tags for each recipe.


Subsequently passing the resultant table as a csv file.

In [ ]:
raw_recipes['tags'] = raw_recipes.tags.apply(lambda x : x[1:-1].split(', '))
raw_recipes = raw_recipes.explode('tags')

In [ ]:
raw_recipes['tags'] = raw_recipes['tags'].apply(lambda x: x[1:-1])

In [ ]:
raw_recipes_tags = raw_recipes.loc[:,['id','tags']].drop_duplicates()
path = '/content/drive/My Drive/Project - CIS 550/'
raw_recipes_tags.to_csv(path+'/RecipesTags.csv')

In [ ]:
recipes = raw_recipes[['id','name','description']]

In [ ]:
raw_recipes

# **InRecipe**


A table representing the ingredientsID present for each recipeID. 

RecipeID is a foreign key referencing to ID in Recipes table
ingredientsID is a foreign key referencing to ID in Ingredients table.

In [ ]:
InRecipe = raw_recipes.loc[:,['id','ingredients']]
InRecipe['ingredients'] = InRecipe.ingredients.apply(lambda x : x[1:-1].split(', '))
InRecipe = InRecipe.explode('ingredients')
InRecipe['ingredients'] = InRecipe['ingredients'].astype(str).apply(lambda x: x[1:-1])
InRecipe.drop_duplicates(inplace=True)
InRecipe

            id        ingredients
0       137739      winter squash
0       137739  mexican seasoning
0       137739        mixed spice
0       137739              honey
0       137739             butter
...        ...                ...
231636  298509               eggs
231636  298509              flour
231636  298509    cream of tartar
231636  298509        baking soda
231636  298509    vanilla extract

[2103109 rows x 2 columns]

In [ ]:
InRecipe_final = InRecipe.merge(Ingredients,on='ingredients').loc[:,['id','index']]
InRecipe_final

             id  index
0        137739      0
1         85912      0
2        121604      0
3         70514      0
4        147409      0
...         ...    ...
2103104   20948  14912
2103105  485697  14913
2103106  485697  14914
2103107  334581  14915
2103108  245641  14916

[2103109 rows x 2 columns]

In [ ]:
InRecipe_final.to_csv(path+'/InRecipe.csv')

In [ ]:
starting_point = 1723188+122000
InRecipe_end = InRecipe_final.iloc[starting_point:]
InRecipe_end.to_csv(path+'/InRecipeEND.csv')

In [ ]:
InRecipe_end

# **Ingredients**

In [ ]:
Ingredients = InRecipe['ingredients']
Ingredients.drop_duplicates(inplace=True)
Ingredients = Ingredients.reset_index()['ingredients'].reset_index()
Ingredients

       index                         ingredients
0          0                       winter squash
1          1                   mexican seasoning
2          2                         mixed spice
3          3                               honey
4          4                              butter
...      ...                                 ...
14912  14912                      apricot jell-o
14913  14913  rosarita premium whole black beans
14914  14914  hunt's fire roasted diced tomatoes
14915  14915             skinless halibut fillet
14916  14916                           nepitella

[14917 rows x 2 columns]

In [ ]:
Ingredients.to_csv(path+'/Ingredients.csv')

In [ ]:
raw_recipes['ingredients'] = raw_recipes['ingredients'].apply(lambda x: x[1:-1])

In [ ]:
recipes = recipes.drop_duplicates()

In [ ]:
recipes.sort_values(by='id').head(20)

In [ ]:
recipes.to_csv(path+'/Recipes.csv')

# **Instructions / Steps**

A table that contains information on step by step instructions for a recipe.

In [ ]:
steps_df = raw_recipes[['id','steps']]
steps_df

            id                                              steps
0       137739  ['make a choice and proceed with recipe', 'dep...
1        31490  ['preheat oven to 425 degrees f', 'press dough...
2       112140  ['brown ground beef in large pot', 'add choppe...
3        59389  ['place potatoes in a large pot of lightly sal...
4        44061  ['mix all ingredients& boil for 2 1 / 2 hours ...
...        ...                                                ...
231632  486161  ['heat oil in a 4-quart dutch oven', 'add cele...
231633  493372        ['mix all ingredients together thoroughly']
231634  308080  ['in a bowl , combine the mashed yolks and may...
231635  298512  ['place melted butter in a large mixing bowl a...
231636  298509  ['whip sugar and shortening in a large bowl , ...

[231637 rows x 2 columns]

In [ ]:
steps_df['steps'] = steps_df.steps.apply(lambda x : x[1:-1].split("', '"))
steps_df['steps'] = steps_df.steps.apply(lambda x : list(zip(list(range(1,len(x)+1)),x)))
steps_df = steps_df.explode('steps')
steps_df.loc[:,'stepNum']=steps_df.steps.map(lambda x:x[0])
steps_df.loc[:,'instruction']=steps_df.steps.map(lambda x:x[1])

steps_df.drop(columns=['steps'],inplace=True)

steps_df.instruction = steps_df.instruction.apply(lambda x : x.replace("'",""))
steps_df

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

            id  stepNum                                        instruction
0       137739        1              make a choice and proceed with recipe
0       137739        2  depending on size of squash , cut into half or...
0       137739        3                                       remove seeds
0       137739        4  for spicy squash , drizzle olive oil or melted...
0       137739        5               season with mexican seasoning mix ii
...        ...      ...                                                ...
231636  298509        1  whip sugar and shortening in a large bowl , ad...
231636  298509        2                  add remaining ingredients and mix
231636  298509        3           knead dough into ball , roll out and cut
231636  298509        4                              place on cookie sheet
231636  298509        5         bake at 350 degrees f for 10 to 12 minutes

[2210703 rows x 3 columns]

In [ ]:
steps_df.to_csv(path+"/Steps.csv")